# Creating a Series

In [1]:
import pandas as pd
s = pd.Series([100, 200, 300, 400])
print(s)

0    100
1    200
2    300
3    400
dtype: int64

In [1]:
import pandas as pd
s = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])
print(s)

a    10
b    20
c    30
d    40
dtype: int64

In [2]:
data = [101, 203, 304]
labels = ['item1', 'item2', 'item3']
series = pd.Series(data, index=labels)
print(series)

item1    101
item2    203
item3    304
dtype: int64

In [3]:
series = series.sort_index()
print(series)

item1    101
item2    203
item3    304
dtype: int64

In [4]:
series = series.sort_values()
print(series)

item1    101
item2    203
item3    304
dtype: int64

# Creating a DataFrame

In [5]:
import pandas as pd
data = {
            'Name': ['khan ', 'ali', 'waqar'], 
            'Age': [25, 30, 35],
            'Salary': [1000, 2000, 3000]
        }
df = pd.DataFrame(data)
print(df)

    Name  Age  Salary
0  khan    25    1000
1    ali   30    2000
2  waqar   35    3000

In [6]:
import pandas as pd
data = pd.DataFrame({
            'Name': ['SOBAN', 'babar', 'Ghafir'], 
            'Age': [25, 30, 35],
            'Salary': [20000, 30000, 60000]
        })
print(data)

     Name  Age  Salary
0   SOBAN   25   20000
1   babar   30   30000
2  Ghafir   35   60000

In [7]:
df1 = pd.DataFrame({
    'S': [10, 20, 30],
    'A': [1001, 2002, 3003]
}, index=['S','G','M'])
print(df1)

    S     A
S  10  1001
G  20  2002
M  30  3003

In [8]:
df1.head()

    S     A
S  10  1001
G  20  2002
M  30  3003

In [9]:
df1.head(1)

    S     A
S  10  1001

In [10]:
df1.tail()

    S     A
S  10  1001
G  20  2002
M  30  3003

In [11]:
df.shape

(3, 3)

In [14]:
df1.columns.tolist()

['S', 'A']

In [13]:
df1.index

Index(['S', 'G', 'M'], dtype='object')

In [15]:
df1.dtypes

S    int64
A    int64
dtype: object

In [34]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, S to A
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   S       3 non-null      int64
 1   A       3 non-null      int64
dtypes: int64(2)
memory usage: 72.0+ bytes

In [16]:
df1.describe()

          S       A
count   3.0     3.0
mean   20.0  2002.0
std    10.0  1001.0
min    10.0  1001.0
25%    15.0  1501.5
50%    20.0  2002.0
75%    25.0  2502.5
max    30.0  3003.0

In [17]:
df1.sample(2)

    S     A
M  30  3003
G  20  2002

In [18]:
df1.to_string()

'    S     A\nS  10  1001\nG  20  2002\nM  30  3003'

# Data Selection & Indexing?

## Selecting Columns

### Single column (Series)

In [41]:
data['Age']

0    25
1    30
2    35
Name: Age, dtype: int64

In [43]:
data['Salary']

0    20000
1    30000
2    60000
Name: Salary, dtype: int64

## Multiple columns (DataFrame)

In [19]:
data

     Name  Age  Salary
0   SOBAN   25   20000
1   babar   30   30000
2  Ghafir   35   60000

In [20]:
data[['Name', 'Age']]

     Name  Age
0   SOBAN   25
1   babar   30
2  Ghafir   35

In [21]:
data[['Name', 'Salary']]

     Name  Salary
0   SOBAN   20000
1   babar   30000
2  Ghafir   60000

# Selecting Rows

## label-based

In [22]:
data.loc[0]

Name      SOBAN
Age          25
Salary    20000
Name: 0, dtype: object

In [23]:
data.loc[0:1]

    Name  Age  Salary
0  SOBAN   25   20000
1  babar   30   30000

In [55]:
df1

    S     A
S  10  1001
H  20  2002
A  30  3003

In [27]:
rows_x_to_z = df1.loc['S','A'] 
print(rows_x_to_z)

1001

In [61]:
col_a = df1.loc[:, 'A'] 
print(col_a)

S    1001
H    2002
A    3003
Name: A, dtype: int64

## integer position-based

In [62]:
df.iloc[0]

Name      khan
Age          25
Salary     1000
Name: 0, dtype: object

In [28]:
df1

    S     A
S  10  1001
G  20  2002
M  30  3003

In [31]:
df.iloc[0:2]

    Name  Age  Salary
0  khan    25    1000
1    ali   30    2000

In [30]:
first_row = df1.iloc[0]
print(first_row)

S      10
A    1001
Name: S, dtype: int64

In [32]:
rows_0_to_1 = df1.iloc[0:2]
print(rows_0_to_1)

    S     A
S  10  1001
G  20  2002

In [71]:
col_b = df1.iloc[:, 1] 
print(col_b)

S    1001
H    2002
A    3003
Name: A, dtype: int64

In [33]:
df.loc[1, 'Salary'] = 65000
df.loc[1]

Name        ali
Age          30
Salary    65000
Name: 1, dtype: object

## Aditional Selection

In [34]:
df[df['Age'] > 25]

    Name  Age  Salary
1    ali   30   65000
2  waqar   35    3000

# Handling Missing Data

## Detecting Missing Data

In [35]:
missing_data = {
    'A': [1, 2, None, 4],
    'B': [None, 5, 6, 7],
    'C': [8, 9, 10, None]
}
missing_data = pd.DataFrame(missing_data)

In [81]:
missing_data = pd.DataFrame({
    'A': [11, 22, None, 43],
    'B': [None, 54, 63, 72],
    'C': [80, None, 100, None]
})
missing_data

      A     B      C
0  11.0   NaN   80.0
1  22.0  54.0    NaN
2   NaN  63.0  100.0
3  43.0  72.0    NaN

In [83]:
missing_data.isnull()

       A      B      C
0  False   True  False
1  False  False   True
2   True  False  False
3  False  False   True

In [85]:
missing_data.isnull().sum()

A    1
B    1
C    2
dtype: int64

# Changing Data Types

In [87]:
df['Age']

0    25
1    30
2    35
Name: Age, dtype: int64

In [89]:
df['Age'] = df['Age'].astype(float)  
print(df.dtypes)

Name       object
Age       float64
Salary      int64
dtype: object

In [90]:
df['Age']

0    25.0
1    30.0
2    35.0
Name: Age, dtype: float64

# Removing Duplicates

In [36]:
df_with_duplicates = pd.DataFrame({
    'Name': ['Ghafir ', 'Babar', 'Ali', 'khizar'], 
    'Age': [21, 13, 22, 30],
    'Salary': [500, 600, 500, 700]
}) 
print(df_with_duplicates)

      Name  Age  Salary
0  Ghafir    21     500
1    Babar   13     600
2      Ali   22     500
3   khizar   30     700

In [37]:
print(df_with_duplicates.duplicated())

0    False
1    False
2    False
3    False
dtype: bool

In [38]:
print(df_with_duplicates.drop_duplicates())

      Name  Age  Salary
0  Ghafir    21     500
1    Babar   13     600
2      Ali   22     500
3   khizar   30     700

# Data Aggregation & Grouping

In [39]:
df

    Name  Age  Salary
0  khan    25    1000
1    ali   30   65000
2  waqar   35    3000

In [40]:
print(df['Salary'].sum())

69000

In [41]:
print(df['Age'].mean())

30.0

In [106]:
print(df['Salary'].count())

3

In [42]:
print(df['Age'].min())

25

In [43]:
print(df['Salary'].max())

65000

In [44]:
grouped = df.groupby('Age').sum()

In [46]:
grouped

      Name  Salary
Age
25   khan     1000
30     ali   65000
35   waqar    3000

In [116]:
grouped_salary_mean = df.groupby('Age')['Salary'].mean()

In [118]:
grouped_salary_mean

Age
25.0     1000.0
30.0    65000.0
35.0     3000.0
Name: Salary, dtype: float64

In [120]:
grouped_age_mean = df.groupby('Salary')['Age'].mean()   
grouped_age_mean

Salary
1000     25.0
3000     35.0
65000    30.0
Name: Age, dtype: float64

In [50]:
groupby1 = pd.DataFrame([
    {'Name': 'Soban', 'Age': 20, 'Salary': 1000},
    {'Name': 'Rayan', 'Age': 21, 'Salary': 4000},
    {'Name': 'Ghafir', 'Age': 23, 'Salary': 9000},
    
])

In [51]:
groupby1

     Name  Age  Salary
0   Soban   20    1000
1   Rayan   21    4000
2  Ghafir   23    9000

In [52]:
groupby1

     Name  Age  Salary
0   Soban   20    1000
1   Rayan   21    4000
2  Ghafir   23    9000

In [127]:
grouped_salary_mean = groupby1.groupby('Age')['Salary'].mean()
grouped_salary_mean

Age
20    1000.0
21    4000.0
22    6500.0
23    9000.0
Name: Salary, dtype: float64

In [130]:
aggregated = df.groupby('Age').agg({
    'Salary': ['mean', 'sum'],
    'Name': 'count'
})

In [132]:
aggregated

       Salary         Name
         mean    sum count
Age
25.0   1000.0   1000     1
30.0  65000.0  65000     1
35.0   3000.0   3000     1

# Concatenation

In [53]:
df1 = pd.DataFrame({
    'Name': ['soban', 'ali'], 
    'Age': [20, 18],
    'Salary': [500, 600]
})
df2 = pd.DataFrame({
    'Name': ['khan', 'shah'], 
    'Age': [28, 25],
    'Salary': [700, 800]
})

In [54]:
df1

    Name  Age  Salary
0  soban   20     500
1    ali   18     600

In [55]:
df2

   Name  Age  Salary
0  khan   28     700
1  shah   25     800

In [141]:
df_concat = pd.concat([df1, df2], ignore_index=True)

In [142]:
df_concat

    Name  Age  Salary
0  shazi   20     500
1    ali   18     600
2   khan   28     700
3   shah   25     800

In [144]:
df_concat_horizontal = pd.concat([df1, df2], axis=1)

In [146]:
df_concat_horizontal

    Name  Age  Salary  Name  Age  Salary
0  shazi   20     500  khan   28     700
1    ali   18     600  shah   25     800

# MERGE

In [149]:
df1 = pd.DataFrame({
    'Name': ['Ali', 'khan'], 
    'Age': [25, 30]
})
df1

   Name  Age
0   Ali   25
1  khan   30

In [152]:
df2 = pd.DataFrame({
    'Name': ['Ali', 'khan'], 
    'Salary': [500, 700]
})
df2

   Name  Salary
0   Ali     500
1  khan     700

In [154]:
df_merged = pd.merge(df1, df2, on='Name')
print(df_merged)

   Name  Age  Salary
0   Ali   25     500
1  khan   30     700

In [156]:
df_merged = pd.merge(df1, df2, on='Name', how='inner')
print(df_merged)

   Name  Age  Salary
0   Ali   25     500
1  khan   30     700

In [158]:
df_merged = pd.merge(df1, df2, on='Name', how='outer')
print(df_merged)

   Name  Age  Salary
0   Ali   25     500
1  khan   30     700

In [160]:
df_merged = pd.merge(df1, df2, on='Name', how='left')
print(df_merged)

   Name  Age  Salary
0   Ali   25     500
1  khan   30     700

In [162]:
df_merged = pd.merge(df1, df2, on='Name', how='right')
print(df_merged)

   Name  Age  Salary
0   Ali   25     500
1  khan   30     700

# Join

In [169]:
df1 = pd.DataFrame({
    'Name': ['Ali', 'khan'], 
    'Age': [25, 30]
})
df2 = pd.DataFrame({
    'Salary': [50000, 60000]
}, index=['Ali', 'shazi'])

In [170]:
df1

   Name  Age
0   Ali   25
1  khan   30

In [171]:
df2

       Salary
Ali     50000
shazi   60000

In [173]:
df_joined = df1.join(df2, how='outer')
print(df_joined)

       Name   Age   Salary
0       Ali  25.0      NaN
1      khan  30.0      NaN
Ali     NaN   NaN  50000.0
shazi   NaN   NaN  60000.0

In [175]:
df_joined = df1.join(df2, how='inner')
print(df_joined)

Empty DataFrame
Columns: [Name, Age, Salary]
Index: []

In [177]:
df_joined = df1.join(df2, how='left')
print(df_joined)

   Name  Age  Salary
0   Ali   25     NaN
1  khan   30     NaN

In [179]:
df_joined = df1.join(df2, how='right')
print(df_joined)

      Name  Age  Salary
Ali    NaN  NaN   50000
shazi  NaN  NaN   60000

# Time Series Data

In [181]:
date_rng = pd.date_range(start='2002-01-01', end='2003-01-10', freq='D')
ts_df = pd.DataFrame(date_rng, columns=['date'])
print(ts_df)

          date
0   2002-01-01
1   2002-01-02
2   2002-01-03
3   2002-01-04
4   2002-01-05
..         ...
370 2003-01-06
371 2003-01-07
372 2003-01-08
373 2003-01-09
374 2003-01-10

[375 rows x 1 columns]

In [183]:
import pandas as pd

data = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03'],
    'Value': [10, 20, 30]
}
df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])
print(df)

        Date  Value
0 2023-01-01     10
1 2023-01-02     20
2 2023-01-03     30

# Resampling

In [191]:
import pandas as pd

data = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-15', '2023-03-01'],
    'Value': [10, 20, 30, 40]
}
df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])
df.set_index('Date', inplace=True)


monthly_avg = df.resample('M').mean()
print(monthly_avg)

            Value
Date
2023-01-31   20.0
2023-02-28    NaN
2023-03-31   40.0

C:\Users\skhan\AppData\Local\Temp\ipykernel_8960\672850494.py:12: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  monthly_avg = df.resample('M').mean()

# Time-Base Selection

In [192]:
january_data = df.loc['2023-01-01':'2023-01-31']
print(january_data)

            Value
Date
2023-01-01     10
2023-01-02     20
2023-01-15     30

# Shifting Data

In [193]:
df['PrevDay'] = df['Value'].shift(1)
print(df)

            Value  PrevDay
Date
2023-01-01     10      NaN
2023-01-02     20     10.0
2023-01-15     30     20.0
2023-03-01     40     30.0

# Handling Text Data

In [197]:
import pandas as pd

data = {
    'Name': ['Ali', 'Baber', 'khan', 'shah'],
    'Age': [25, 30, 35, 42]
}
df = pd.DataFrame(data)

print(df)

    Name  Age
0    Ali   25
1  Baber   30
2   khan   35
3   shah   42

## Convert all names to lowercase

In [199]:
ab = df['Name'].str.lower()        
ab

0      ali
1    baber
2     khan
3     shah
Name: Name, dtype: object

## Check if 'a' in string

In [202]:
df['Name'].str.contains('b')

0    False
1     True
2    False
3    False
Name: Name, dtype: bool

## Extracting the first letter of each name

In [204]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Ali', 'Baber', 'khan', 'shazi'],
    'Age': [25, 30, 35, 40]
}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Ali   25
1  Baber   30
2   khan   35
3  shazi   40

In [206]:
df['Initial'] = df['Name'].str[0]
print(df)

    Name  Age Initial
0    Ali   25       A
1  Baber   30       B
2   khan   35       k
3  shazi   40       s

## Split the 'Name' column by space

In [211]:
import pandas as pd

data = {
    'Name': ['Ali khan', 'shazi khan', 'zaib khan', 'nomi khan'],
    'Age': [25, 30, 35, 40]
}
df = pd.DataFrame(data)
print(df)

         Name  Age
0    Ali khan   25
1  shazi khan   30
2   zaib khan   35
3   nomi khan   40

In [210]:
df['Name_Split'] = df['Name'].str.split(' ')
print(df)

         Name  Age     Name_Split
0    Ali khan   25    [Ali, khan]
1  shazi khan   30  [shazi, khan]
2   zaib khan   35   [zaib, khan]
3   nomi khan   40   [nomi, khan]

# Replace 'Alice' with 'Alicia' in the 'Name' column

In [214]:
import pandas as pd

data = {
    'Name': ['Ali khan', 'shazi khan', 'zaib khan', 'nomi khan'],
    'Age': [25, 30, 35, 40]
}
df = pd.DataFrame(data)
print(df)

         Name  Age
0    Ali khan   25
1  shazi khan   30
2   zaib khan   35
3   nomi khan   40

In [216]:
df['Name'] = df['Name'].str.replace('Alice', 'Alicia')
print(df)

         Name  Age
0    Ali khan   25
1  shazi khan   30
2   zaib khan   35
3   nomi khan   40

## Pivot Tables & Crosstabs

### Create a pivot table: mean income by AgeGroup and Gender

In [218]:
import pandas as pd

data = {
    'AgeGroup': ['20-25', '25-30', '30-340', '40-50', '50-60'],
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Female'],
    'Income': [4000, 4200, 5000, 5200, 4300]
}
df = pd.DataFrame(data)
print(df)

  AgeGroup  Gender  Income
0    20-25    Male    4000
1    25-30  Female    4200
2   30-340    Male    5000
3    40-50  Female    5200
4    50-60  Female    4300

In [221]:

pivot = pd.pivot_table(df, values='Income', index='AgeGroup', columns='Gender', aggfunc='mean')
print(pivot)

Gender    Female    Male
AgeGroup
20-25        NaN  4000.0
25-30     4200.0     NaN
30-340       NaN  5000.0
40-50     5200.0     NaN
50-60     4300.0     NaN

# Compute frequency table (crosstab) of AgeGroup vs Gender

In [222]:
import pandas as pd

data = {
    'AgeGroup': ['20-25', '25-30', '30-340', '40-50', '50-60'],
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Female'],
    'Income': [4000, 4200, 5000, 5200, 4300]
}
df = pd.DataFrame(data)
print(df)

  AgeGroup  Gender  Income
0    20-25    Male    4000
1    25-30  Female    4200
2   30-340    Male    5000
3    40-50  Female    5200
4    50-60  Female    4300

In [224]:
crosstab = pd.crosstab(df['AgeGroup'], df['Gender'])
print(crosstab)

Gender    Female  Male
AgeGroup
20-25          0     1
25-30          1     0
30-340         0     1
40-50          1     0
50-60          1     0

# Creating CSV File

In [229]:
import pandas as pd
import numpy as np

data = {
    'Name': ['SAMI KHAN', 'KASHIF KHAN', 'SHAHZAIB KHAN ', 'UMAR KHAN', 'NOUMAN KHAN', None ],
    'Age': [25, 30, 35, 40, 25, np.nan],
    'Salary': [5000, 6000, 7000, 8000, 5000, 9000],
    'Gender': ['male', 'Male', 'Male', 'Male', 'male', 'male'],
    'Date': ['2023-01-01', '2023-01-02', '2023-01-15', '2023-02-01', '2023-01-01', '2023-03-01'],
    'Department': ['HR', 'IT', 'IT', 'Finance', 'HR', 'Finance'],
    'Has_Passed': [True, False, True, True, True, False],
    'Score': [88.5, 92.0, np.nan, 85.0, 88.5, 79.0]
}

df = pd.DataFrame(data)
df

,Name,Age,Salary,Gender,Date,Department,Has_Passed,Score
0,SAMI KHAN,25.0,5000,male,2023-01-01,HR,True,88.5
1,KASHIF KHAN,30.0,6000,Male,2023-01-02,IT,False,92.0
2,SHAHZAIB KHAN,35.0,7000,Male,2023-01-15,IT,True,NaN
3,UMAR KHAN,40.0,8000,Male,2023-02-01,Finance,True,85.0
4,NOUMAN KHAN,25.0,5000,male,2023-01-01,HR,True,88.5
5,None,NaN,9000,male,2023-03-01,Finance,False,79.0

In [231]:
df['Date'] = pd.to_datetime(df['Date'])
print(df)

             Name   Age  Salary Gender       Date Department  Has_Passed  \
0       SAMI KHAN  25.0    5000   male 2023-01-01         HR        True
1     KASHIF KHAN  30.0    6000   Male 2023-01-02         IT       False
2  SHAHZAIB KHAN   35.0    7000   Male 2023-01-15         IT        True
3       UMAR KHAN  40.0    8000   Male 2023-02-01    Finance        True
4     NOUMAN KHAN  25.0    5000   male 2023-01-01         HR        True
5            None   NaN    9000   male 2023-03-01    Finance       False

   Score
0   88.5
1   92.0
2    NaN
3   85.0
4   88.5
5   79.0

# Convert 'Gender' column to category type

In [233]:
import pandas as pd

data = {
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Female', 'Male'],
    'AgeGroup': ['20-29', '20-29', '30-39', '30-39', '20-29', '40-49'],
    'Income': [4000, 4200, 5000, 5200, 4300, 6000]
}
df = pd.DataFrame(data)
print(df)

   Gender AgeGroup  Income
0    Male    20-29    4000
1  Female    20-29    4200
2    Male    30-39    5000
3  Female    30-39    5200
4  Female    20-29    4300
5    Male    40-49    6000

In [235]:
df['Gender'] = df['Gender'].astype('category')
print(df.dtypes)

Gender      category
AgeGroup      object
Income         int64
dtype: object

In [237]:
print(df['Gender'].cat.categories)
print(df['Gender'].cat.codes)

Index(['Female', 'Male'], dtype='object')
0    1
1    0
2    1
3    0
4    0
5    1
dtype: int8

# convert 'Income' to thousands and create a new column 'Income_K'

In [239]:
df['Income_K'] = df['Income'].apply(lambda x: x / 1000)
print(df)

   Gender AgeGroup  Income  Income_K
0    Male    20-29    4000       4.0
1  Female    20-29    4200       4.2
2    Male    30-39    5000       5.0
3  Female    30-39    5200       5.2
4  Female    20-29    4300       4.3
5    Male    40-49    6000       6.0

# map() to create a new column 'AgeGroup' based on 'Age'

In [241]:
import pandas as pd

data = {
    'Age': [15, 22, 17, 35, 12, 28]
}
df = pd.DataFrame(data)
print(df)

   Age
0   15
1   22
2   17
3   35
4   12
5   28

In [243]:
df['AgeGroup'] = df['Age'].map(lambda x: 'Adult' if x >= 18 else 'Minor')
print(df)

   Age AgeGroup
0   15    Minor
1   22    Adult
2   17    Minor
3   35    Adult
4   12    Minor
5   28    Adult

# Use .query() for fast filtering

In [245]:
import pandas as pd

data = {
    'Name': ['Ali', 'Baber', 'khan', 'shazi', 'shah', 'rana'],
    'Age': [25, 35, 40, 28, 25, 35],
    'Income': [48000, 60000, 70000, 52000, 30000, 60000]
}
df = pd.DataFrame(data)
print(df)

    Name  Age  Income
0    Ali   25   48000
1  Baber   35   60000
2   khan   40   70000
3  shazi   28   52000
4   shah   25   30000
5   rana   35   60000

In [247]:
result = df.query('Age > 30 & Income > 50000')
print(result)

    Name  Age  Income
1  Baber   35   60000
2   khan   40   70000
5   rana   35   60000